name: "jina_query"
platform: "tensorrt_plan"
max_batch_size: 8

input [
  { name: "input_ids", data_type: TYPE_INT64, dims: [ -1 ] },
  { name: "attention_mask", data_type: TYPE_INT64, dims: [ -1 ] }
]
output [
  { name: "13049", data_type: TYPE_FP32, dims: [ 1024 ] },
  { name: "text_embeds", data_type: TYPE_FP32, dims: [ -1, 1024 ] }
]

dynamic_batching {
  max_queue_delay_microseconds: 100
}